In [5]:
import numpy as np
import pandas as pd
import numpy.random as r

In [92]:
df = pd.DataFrame(r.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [93]:
df

          W         X         Y         Z
A -0.492993 -0.413648 -0.035999 -0.103608
B  0.463244 -0.614068  1.236613 -0.194465
C -0.455264  0.196044  0.326921 -0.024924
D -0.216584  0.685091  0.817096  0.618370
E -1.032151 -0.964299 -0.363422 -0.207315

In [11]:
df['W']

A   -0.138329
B    1.088740
C    0.272745
D    0.300192
E   -0.303897
Name: W, dtype: float64

In [13]:
df[['W','X']]

          W         X
A -0.138329 -1.780830
B  1.088740 -1.589154
C  0.272745  1.099098
D  0.300192  0.952828
E -0.303897  1.552789

In [15]:
df.shape

(5, 4)

In [16]:
#adding arithmetic

In [17]:
df['new'] = df['W']+df['X']

In [18]:
df

          W         X         Y         Z       new
A -0.138329 -1.780830 -0.549111  0.541171 -1.919159
B  1.088740 -1.589154 -0.515312  0.682546 -0.500414
C  0.272745  1.099098  0.088401 -1.176235  1.371843
D  0.300192  0.952828  0.858077  0.700232  1.253020
E -0.303897  1.552789 -0.346028 -2.518319  1.248892

In [19]:
df.drop('new',axis=1,inplace = True)

In [20]:
df

          W         X         Y         Z
A -0.138329 -1.780830 -0.549111  0.541171
B  1.088740 -1.589154 -0.515312  0.682546
C  0.272745  1.099098  0.088401 -1.176235
D  0.300192  0.952828  0.858077  0.700232
E -0.303897  1.552789 -0.346028 -2.518319

In [22]:
df.drop('E',axis = 0,inplace =True)

In [23]:
df

          W         X         Y         Z
A -0.138329 -1.780830 -0.549111  0.541171
B  1.088740 -1.589154 -0.515312  0.682546
C  0.272745  1.099098  0.088401 -1.176235
D  0.300192  0.952828  0.858077  0.700232

In [24]:
# columns and rows are series

In [26]:
df['W']

A   -0.138329
B    1.088740
C    0.272745
D    0.300192
Name: W, dtype: float64

In [27]:
df.loc['C']

W    0.272745
X    1.099098
Y    0.088401
Z   -1.176235
Name: C, dtype: float64

In [28]:
df.iloc[2]

W    0.272745
X    1.099098
Y    0.088401
Z   -1.176235
Name: C, dtype: float64

In [29]:
#subsets

In [31]:
df.loc['B']['X']

-1.589154280599362

In [33]:
df.loc['B','X']

-1.589154280599362

In [34]:
df.loc[['B','C'],['W','Y']]

          W         Y
B  1.088740 -0.515312
C  0.272745  0.088401

In [43]:
#operations

In [44]:
df[df >0]

          W         X         Y         Z
A       NaN       NaN       NaN  0.541171
B  1.088740       NaN       NaN  0.682546
C  0.272745  1.099098  0.088401       NaN
D  0.300192  0.952828  0.858077  0.700232

In [46]:
# SELECT * FROM tabl WHERE W>0
df[df['W']>0]

          W         X         Y         Z
B  1.088740 -1.589154 -0.515312  0.682546
C  0.272745  1.099098  0.088401 -1.176235
D  0.300192  0.952828  0.858077  0.700232

In [48]:
df['W']

A   -0.138329
B    1.088740
C    0.272745
D    0.300192
Name: W, dtype: float64

In [51]:
boolser = df['W']>0

In [52]:
df[boolser]

          W         X         Y         Z
B  1.088740 -1.589154 -0.515312  0.682546
C  0.272745  1.099098  0.088401 -1.176235
D  0.300192  0.952828  0.858077  0.700232

In [57]:
# SELECT * FROM tabl WHERE W>0 AND id = D
df[df['W']>0].loc['D']

W    0.300192
X    0.952828
Y    0.858077
Z    0.700232
Name: D, dtype: float64

In [60]:
# SELECT W,X FROM tabl WHERE W>0
df[df['W']>0][['W','X']]

          W         X
B  1.088740 -1.589154
C  0.272745  1.099098
D  0.300192  0.952828

In [61]:
#conditionals

In [64]:
#SELECT * FROM tab WHERE w>0 and y>1
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z
C  0.272745  1.099098  0.088401 -1.176235
D  0.300192  0.952828  0.858077  0.700232

In [65]:
#SELECT * FROM tab WHERE w>0 or y>1
df[(df['W']>0) | (df['Y']>0)]

          W         X         Y         Z
B  1.088740 -1.589154 -0.515312  0.682546
C  0.272745  1.099098  0.088401 -1.176235
D  0.300192  0.952828  0.858077  0.700232

In [66]:
df

          W         X         Y         Z
A -0.138329 -1.780830 -0.549111  0.541171
B  1.088740 -1.589154 -0.515312  0.682546
C  0.272745  1.099098  0.088401 -1.176235
D  0.300192  0.952828  0.858077  0.700232

In [68]:
#use inplace = true
#reset index resets index and sets pervious index as column
df.reset_index()

  index         W         X         Y         Z
0     A -0.138329 -1.780830 -0.549111  0.541171
1     B  1.088740 -1.589154 -0.515312  0.682546
2     C  0.272745  1.099098  0.088401 -1.176235
3     D  0.300192  0.952828  0.858077  0.700232

In [96]:
#set index
states = 'IN CA US BD CD'.split(" ")
df['States'] = states

In [97]:
df

          W         X         Y         Z States
A -0.492993 -0.413648 -0.035999 -0.103608     IN
B  0.463244 -0.614068  1.236613 -0.194465     CA
C -0.455264  0.196044  0.326921 -0.024924     US
D -0.216584  0.685091  0.817096  0.618370     BD
E -1.032151 -0.964299 -0.363422 -0.207315     CD

In [98]:
df.set_index('States',inplace = True)

In [102]:
df

               W         X         Y         Z
States
IN     -0.492993 -0.413648 -0.035999 -0.103608
CA      0.463244 -0.614068  1.236613 -0.194465
US     -0.455264  0.196044  0.326921 -0.024924
BD     -0.216584  0.685091  0.817096  0.618370
CD     -1.032151 -0.964299 -0.363422 -0.207315

In [103]:
df.reset_index()

  States         W         X         Y         Z
0     IN -0.492993 -0.413648 -0.035999 -0.103608
1     CA  0.463244 -0.614068  1.236613 -0.194465
2     US -0.455264  0.196044  0.326921 -0.024924
3     BD -0.216584  0.685091  0.817096  0.618370
4     CD -1.032151 -0.964299 -0.363422 -0.207315

In [104]:
df.reset_index(drop=True)

          W         X         Y         Z
0 -0.492993 -0.413648 -0.035999 -0.103608
1  0.463244 -0.614068  1.236613 -0.194465
2 -0.455264  0.196044  0.326921 -0.024924
3 -0.216584  0.685091  0.817096  0.618370
4 -1.032151 -0.964299 -0.363422 -0.207315

In [105]:
#dataframes 3
#multiindexing

In [108]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hire_index = list(zip(outside,inside))
hire_index = pd.MultiIndex.from_tuples(hire_index)

In [109]:
hire_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [110]:
df = pd.DataFrame(r.randn(6,2),hire_index,['A','B'])

In [111]:
df

             A         B
G1 1  0.024644  0.578966
   2 -0.137916  1.485826
   3 -0.113819 -0.662720
G2 1 -0.248678  1.521271
   2 -0.288359  2.375567
   3  1.045670 -0.163100

In [113]:
df.index.names

FrozenList([None, None])

In [114]:
df.index.names = ['Groups','Num']

In [115]:
df

                   A         B
Groups Num
G1     1    0.024644  0.578966
       2   -0.137916  1.485826
       3   -0.113819 -0.662720
G2     1   -0.248678  1.521271
       2   -0.288359  2.375567
       3    1.045670 -0.163100

In [116]:
df.loc['G2']

            A         B
Num
1   -0.248678  1.521271
2   -0.288359  2.375567
3    1.045670 -0.163100

In [120]:
df.loc['G2'].loc[3,'A']

1.045670490988751

In [125]:
#cross section
df.xs(1,level = 'Num')

               A         B
Groups
G1      0.024644  0.578966
G2     -0.248678  1.521271

In [126]:
#Missing data

In [143]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [144]:
df = pd.DataFrame(d)

In [145]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [146]:
#remove any row or column with nan
df.dropna()

     A    B  C
0  1.0  5.0  1

In [147]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [148]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [149]:
#add value to nan
df.fillna('value',axis = 1,limit=1)

       A      B  C
0      1      5  1
1      2  value  2
2  value    NaN  3

In [150]:
df.fillna('0')

   A  B  C
0  1  5  1
1  2  0  2
2  0  0  3

In [151]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64